;========== 所有选项 1=启用 0=不启用 ============

[config]

自定义分辨率
width=1920
height=1080


自定义玩家名称, 星号表示随机
player_name=*


允许城池外建造仓库
warehouse_anywhere=1


超级作弊模式，仅用于游戏研究
网络联机模式允许作弊秘籍
所有生产不扣金钱
所有攻击不扣血（免疫伤害）
cheat=0


人口上限(最大255)
population_limit=120

电脑开局人口数( <=人口上限 )
computer_population_begin=30

玩家开局人口数( <=人口上限 )
player_population_begin=8


降低复活所需香火数,复活进度加快
easy_reborn=1


[dobby]

电脑大量招募民夫
00562134=1

兵种升级完成，赠送马匹
005E902D=1

客栈招募后赠送马匹(玩家)
0046E97E=1

客栈招募后赠送马匹(电脑)
0045934C=1

玩家丢失所有城池后，系统强制杀死(必须启用)
004BBB18=1

电脑练兵频率提升
00452A2D=1

电脑兵营出兵，直接出高级兵
0043C28F=1

税收时，大地图出现更多马匹
004718F9=1

税收时，大地图出现更多马匹
00471917=1

开始游戏，大地图出现更多马匹
0046E2E2=1

野外马匹固定为白马，有概率出无敌宝马
0046D9A4=1

民夫自动修理附近机械单位
00442F51=1

矿洞更高储量,树木更高储量
004C4641=1

稻田储量提升
0042888F=1

猪圈储量提升
0042770F=1


[detours]

武将有概率格挡或躲避伤害
004BA9F0=1

兵将有概率暴击(额外伤害)
005EC750=1

武将升级额外成长
00601F50=1

士兵升级额外成长
005E6F70=1

食物和酒水双倍产量
0044F0D0=1

武将每秒恢复/额外经验
00606FC0=1

寺庙半价复活
0061AD20=1

税收时额外赠送金钱
004607A0=1

电脑随时间变强
00471520=1

防止电脑堵死门口
0061D010=1

兵将移动速度增加
006131D0=1


